Repository: endisha/intl-phone-number-format
Catalog: src/languages/intl-phone-number-format-*.po
Languages: ar

source: International Phone Number Settings
ar: إعدادات التنسيق الدولي لرقم الهاتف

source: Set up international phone number configurations
ar: التحكم في إعدادات تنسيق رقم الهاتف الدولي

source: Activate
ar: تفعيل

source: Enable or disable the formatting of phone numbers.
ar: تمكين أو تعطيل تنسيق أرقام الهواتف.

source: Lookup User's Country
ar: تحديد الدولة للمستخدم بشكل تلقائي

source: Automatically set and initialize the selected country based on the user's IP address using the IP lookup service.
ar: قم بتعيين وتهيئة الدولة تلقائيًا بناءً على عنوان IP الخاص بالمستخدم باستخدام خدمة البحث عن IP.

source: Country Cache Expiry (hours)
ar: انتهاء صلاحية التخزين المؤقت للدولة (ساعات)

source: Set the duration for caching the user's country.
ar: تحديد مدة التخزين المؤقت للدولة، يساعد هذا الخيار في تقليل عدد الطلبات للاستعلام عن مكان المستخدم.

source: Billing Phone
ar: رقم هاتف الفوترة

source: This is the billing phone number on the frontend checkout form and the edit billing address form.
ar: حقل رقم هاتف الفوترة الخاص بنموذج إتمام الطلب ونموذج تعديل بيانات الفوترة من اعدادات الحساب.

source: Shipping Phone
ar: رقم هاتف الشحن

source: This is the shipping phone number on the frontend checkout form and the edit shipping address form.
ar: حقل رقم هاتف الشحن الخاص بنموذج إتمام الطلب ونموذج تعديل بيانات الشحن من اعدادات الحساب.

source: This is the billing phone number field for the backend edit order page.
ar: حقل رقم هاتف الفوترة لصفحة تحرير الطلب في لوحة التحكم.

source: This is the shipping phone number field for the backend edit order page.
ar: حقل رقم هاتف الشحن لصفحة تحرير الطلب في لوحة التحكم.

source: Settings
ar: الإعدادات

source: International Phone Number Format
ar: التنسيق الدولي لرقم الهاتف

source: %1$s requires %2$s to be activated.
ar: يتطلب %1$s أن يكون الملحق %2$s مفعل.

source: The field must be a valid phone number
ar: تنسيق رقم الهاتف غير صحيح

source: The field is required
ar: الحقل مطلوب

source: <strong>%1$s</strong> format is invalid
ar: تنسيق <strong>%1$s</strong> غير صحيح

source: Fields
ar: الحقول

source: Configure and set up formatted fields for applying an international phone number format.
ar: تكوين وإعداد الحقول لتطبيق تنسيق رقم الهاتف الدولي.

source: Field Label
ar: اسم الحقل

source: Enable
ar: تفعيل

source: Frontend Validation
ar: التحقق من التنسيق (الواجهة)

source: Allows validation of the field in the frontend using the browser
ar: يسمح بالتحقق من صحة الحقل في الواجهة الأمامية باستخدام المتصفح

source: Backend Validation
ar: التحقق من الحقل

source: Allows validation of the field in the backend on the server side
ar: يسمح بالتحقق من صحة تنسيق الحقل في الواجهة الخلفية

source: View Countries From
ar: عرض الدول من

source: Show countries based on your WooCommerce settings
ar: اعرض الدول بناءً على إعدادات WooCommerce الخاصة بك

source: Field Type
ar: نوع الحقل

source: The field type depends on where the field will appear and be associated with it
ar: يعتمد نوع الحقل على المكان الذي سيظهر فيه الحقل ويكون مرتبطًا به

source: Does Not Exist
ar: غير موجود

source: This field does not exist in WooCommerce checkout fields.
ar: هذا الحقل غير موجود ولم يتم تعينه في نموذج صفحة اتمام الطلب.

source: Required
ar: إجباري

source: This is a required WooCommerce checkout field.
ar: هذا الحقل اجباري في نموذج صفحة اتمام الطلب.

source: Optional
ar: اختياري

source: This is an optional WooCommerce checkout field.
ar: هذا الحقل اختياري في نموذج صفحة اتمام الطلب.

source: All Countries
ar: كل الدول

source: Billing Countries
ar: دول الفوترة

source: Shipping Countries
ar: دول الشحن

source: Custom
ar: مخصص

source: Billing
ar: الفوترة

source: Shipping
ar: الشحن

source: No Fields
ar: لاتوجد حقول
